josefwegner/arduino-boards/src/ehajo-avr-2.0.0/boards.txt
# eHaJo AVR -> Board Configuration
# http://www.eHaJo.de
# Feature requests and new boards to: info@ehajo.de

############
# menu names
menu.cpu=Prozessor
menu.clock=Takt
menu.BOD=BOD
menu.LTO=Compiler LTO
menu.variant=Variante
menu.bootloader=Bootloader



##############################################################
##############################################################
##############################################################
##############################################################
# aTeVaL Board begins here:


# aTeVaL general settings here:

ateval-tiny13.name=aTeVaL IC1 (Attiny13, ...)
ateval-tiny13.bootloader.unlock_bits=0xFF
ateval-tiny13.bootloader.lock_bits=0xCF
ateval-tiny13.bootloader.tool=avrdude
ateval-tiny13.build.core=arduino:arduino
ateval-tiny13.build.board=uno
ateval-tiny13.upload.tool=avrdude

ateval-tiny85.name=aTeVaL IC1 (Attiny85, ...)
ateval-tiny85.bootloader.unlock_bits=0xFF
ateval-tiny85.bootloader.lock_bits=0xCF
ateval-tiny85.bootloader.tool=avrdude
ateval-tiny85.build.core=arduino:arduino
ateval-tiny85.build.board=uno
ateval-tiny85.upload.tool=avrdude

ateval-tiny2313.name=aTeVaL IC2 (Attiny2313, ...)
ateval-tiny2313.bootloader.unlock_bits=0xFF
ateval-tiny2313.bootloader.lock_bits=0xCF
ateval-tiny2313.bootloader.tool=avrdude
ateval-tiny2313.build.core=arduino:arduino
ateval-tiny2313.build.board=uno
ateval-tiny2313.upload.tool=avrdude

ateval-mega8.name=aTeVaL IC3 (Atmega328, ...)
ateval-mega8.bootloader.unlock_bits=0xFF
ateval-mega8.bootloader.lock_bits=0xCF
ateval-mega8.bootloader.tool=avrdude
ateval-mega8.build.core=arduino:arduino
ateval-mega8.build.board=uno
ateval-mega8.upload.tool=avrdude

##############################################################
##############################################################
# ateval clock settings for mega here:
ateval-mega8.menu.clock.external16=16MHz (extern!)
ateval-mega8.menu.clock.external16.build.f_cpu=16000000L
ateval-mega8.menu.clock.external16.upload.low_fuses=0xFF
ateval-mega8.menu.clock.internal1=1MHz (intern)
ateval-mega8.menu.clock.internal1.build.f_cpu=1000000L
ateval-mega8.menu.clock.internal1.upload.low_fuses=0x62
ateval-mega8.menu.clock.internal8=8MHz (intern)
ateval-mega8.menu.clock.internal8.build.f_cpu=8000000L
ateval-mega8.menu.clock.internal8.upload.low_fuses=0xE2

##############################################################
# ateval clock settings for tiny13 here:
ateval-tiny13.menu.clock.internal96=9,6MHz (intern)
ateval-tiny13.menu.clock.internal96.build.f_cpu=9600000L
ateval-tiny13.menu.clock.internal96.upload.low_fuses=0x7A
ateval-tiny13.menu.clock.internal12=1,2MHz (intern)
ateval-tiny13.menu.clock.internal12.build.f_cpu=1200000L
ateval-tiny13.menu.clock.internal12.upload.low_fuses=0x6A
ateval-tiny13.menu.clock.internal48=4,8MHz (intern)
ateval-tiny13.menu.clock.internal48.build.f_cpu=4800000L
ateval-tiny13.menu.clock.internal48.upload.low_fuses=0x79
ateval-tiny13.menu.clock.internal06=0,6MHz (intern)
ateval-tiny13.menu.clock.internal06.build.f_cpu=600000L
ateval-tiny13.menu.clock.internal06.upload.low_fuses=0x69
ateval-tiny13.menu.clock.internal128=128kHz (intern)
ateval-tiny13.menu.clock.internal128.build.f_cpu=128000L
ateval-tiny13.menu.clock.internal128.upload.low_fuses=0x7B
ateval-tiny13.menu.clock.internal16=16kHz (intern)
ateval-tiny13.menu.clock.internal16.build.f_cpu=16000L
ateval-tiny13.menu.clock.internal16.upload.low_fuses=0x6B

##############################################################
# ateval clock settings for tiny2313 here:
ateval-tiny2313.menu.clock.internal8=8MHz (intern)
ateval-tiny2313.menu.clock.internal8.build.f_cpu=8000000L
ateval-tiny2313.menu.clock.internal8.upload.low_fuses=0xE4
ateval-tiny2313.menu.clock.internal1=1MHz (intern)
ateval-tiny2313.menu.clock.internal1.build.f_cpu=1000000L
ateval-tiny2313.menu.clock.internal1.upload.low_fuses=0x64
ateval-tiny2313.menu.clock.internal4=4MHz (intern)
ateval-tiny2313.menu.clock.internal4.build.f_cpu=4000000L
ateval-tiny2313.menu.clock.internal4.upload.low_fuses=0xE2
ateval-tiny2313.menu.clock.internal05=0,5MHz (intern)
ateval-tiny2313.menu.clock.internal05.build.f_cpu=500000L
ateval-tiny2313.menu.clock.internal05.upload.low_fuses=0x62
ateval-tiny2313.menu.clock.internal0128=128kHz (intern)
ateval-tiny2313.menu.clock.internal0128.build.f_cpu=128000L
ateval-tiny2313.menu.clock.internal0128.upload.low_fuses=0xE6
ateval-tiny2313.menu.clock.internal016=16kHz (intern)
ateval-tiny2313.menu.clock.internal016.build.f_cpu=16000L
ateval-tiny2313.menu.clock.internal016.upload.low_fuses=0x66

##############################################################
# ateval clock settings for tiny85 here:
ateval-tiny85.menu.clock.internal8=8MHz (intern)
ateval-tiny85.menu.clock.internal8.build.f_cpu=8000000L
ateval-tiny85.menu.clock.internal8.upload.low_fuses=0xE2
ateval-tiny85.menu.clock.internal1=1MHz (intern)
ateval-tiny85.menu.clock.internal1.build.f_cpu=1000000L
ateval-tiny85.menu.clock.internal1.upload.low_fuses=0x62
ateval-tiny85.menu.clock.internal64=6,4MHz (intern)
ateval-tiny85.menu.clock.internal64.build.f_cpu=6400000L
ateval-tiny85.menu.clock.internal64.upload.low_fuses=0xD3
ateval-tiny85.menu.clock.internal08=0,8MHz (intern)
ateval-tiny85.menu.clock.internal08.build.f_cpu=800000L
ateval-tiny85.menu.clock.internal08.upload.low_fuses=0x53
ateval-tiny85.menu.clock.external8=8MHz (extern)
ateval-tiny85.menu.clock.external8.build.f_cpu=8000000L
ateval-tiny85.menu.clock.external8.upload.low_fuses=0xFE
ateval-tiny85.menu.clock.external16=16MHz (extern)
ateval-tiny85.menu.clock.external16.build.f_cpu=16000000L
ateval-tiny85.menu.clock.external16.upload.low_fuses=0xFE

##############################################################
##############################################################
# ateval with Atmega328P with Bootloader
ateval-mega8.menu.cpu.m328bl=Atmega328P (standard)
ateval-mega8.menu.cpu.m328bl.upload.maximum_size=32256
ateval-mega8.menu.cpu.m328bl.upload.maximum_data_size=2048
ateval-mega8.menu.cpu.m328bl.upload.port=UART0
ateval-mega8.menu.cpu.m328bl.upload.speed=115200
ateval-mega8.menu.cpu.m328bl.upload.protocol=arduino
ateval-mega8.menu.cpu.m328bl.bootloader.low_fuses=0xFF
ateval-mega8.menu.cpu.m328bl.bootloader.high_fuses=0xDE
ateval-mega8.menu.cpu.m328bl.bootloader.extended_fuses=0xFD
ateval-mega8.menu.cpu.m328bl.bootloader.file=optiboot_flash/bootloaders/{build.mcu}/{build.f_cpu}/optiboot_flash_{build.mcu}_{upload.port}_{upload.speed}_{build.f_cpu}_{build.bootloader_led}.hex
ateval-mega8.menu.cpu.m328bl.build.mcu=atmega328p
ateval-mega8.menu.cpu.m328bl.build.variant=standard
ateval-mega8.menu.cpu.m328bl.build.f_cpu=16000000L

