josefwegner/arduino-boards/src/ehajo-avr-2.0.0/boards.txt
##############################################################
# ateval with Atmega328P without Bootloader
ateval-mega8.menu.cpu.m328=Atmega328P w/o Bootloader
ateval-mega8.menu.cpu.m328.upload.maximum_size=32768
ateval-mega8.menu.cpu.m328.upload.protocol=avrispmkii
ateval-mega8.menu.cpu.m328.upload.tool=avrdude
ateval-mega8.menu.cpu.m328.upload.extended_fuses=0xFD
ateval-mega8.menu.cpu.m328.upload.high_fuses=0xDE
ateval-mega8.menu.cpu.m328.build.mcu=atmega328p
ateval-mega8.menu.cpu.m328.build.variant=standard

##############################################################
# ateval with Atmega8 without Bootloader
ateval-mega8.menu.cpu.m8=Atmega8 w/o Bootloader
ateval-mega8.menu.cpu.m8.upload.maximum_size=8192
ateval-mega8.menu.cpu.m8.upload.protocol=avrispmkii
ateval-mega8.menu.cpu.m8.upload.tool=avrdude
ateval-mega8.menu.cpu.m8.upload.extended_fuses=0xFD
ateval-mega8.menu.cpu.m8.upload.high_fuses=0xDE
ateval-mega8.menu.cpu.m8.build.mcu=atmega8
ateval-mega8.menu.cpu.m8.build.variant=standard

##############################################################
# ateval with Atmega168P without Bootloader
ateval-mega8.menu.cpu.m168=Atmega168P w/o Bootloader
ateval-mega8.menu.cpu.m168.upload.maximum_size=16384
ateval-mega8.menu.cpu.m168.upload.protocol=avrispmkii
ateval-mega8.menu.cpu.m168.upload.tool=avrdude
ateval-mega8.menu.cpu.m168.upload.extended_fuses=0xFD
ateval-mega8.menu.cpu.m168.upload.high_fuses=0xDE
ateval-mega8.menu.cpu.m168.build.mcu=atmega168p
ateval-mega8.menu.cpu.m168.build.variant=standard

##############################################################
# ateval with Attiny13 attached (no BL here, just for real men.)
ateval-tiny13.menu.cpu.t13=Atiny13 w/o Bootloader
ateval-tiny13.menu.cpu.t13.upload.maximum_size=1024
ateval-tiny13.menu.cpu.t13.upload.protocol=avrispmkii
ateval-tiny13.menu.cpu.t13.upload.tool=avrdude
ateval-tiny13.menu.cpu.t13.upload.high_fuses=0xFF
ateval-tiny13.menu.cpu.t13.upload.extended_fuses=0xFF
ateval-tiny13.menu.cpu.t13.build.mcu=attiny13
ateval-tiny13.menu.cpu.t13.build.variant=t13

##############################################################
# ateval with Attiny2313 attached (no BL here, just for real men.)
ateval-tiny2313.menu.cpu.t2313=Atiny2313 w/o Bootloader
ateval-tiny2313.menu.cpu.t2313.upload.maximum_size=2048
ateval-tiny2313.menu.cpu.t2313.upload.protocol=avrispmkii
ateval-tiny2313.menu.cpu.t2313.upload.tool=avrdude
ateval-tiny2313.menu.cpu.t2313.upload.high_fuses=0xDF
ateval-tiny2313.menu.cpu.t2313.upload.extended_fuses=0xFF
ateval-tiny2313.menu.cpu.t2313.build.mcu=attiny2313
ateval-tiny2313.menu.cpu.t2313.build.variant=t2313

##############################################################
# ateval with Attiny4313 attached (no BL here, just for real men.)
ateval-tiny2313.menu.cpu.t4313=Atiny4313 w/o Bootloader
ateval-tiny2313.menu.cpu.t4313.upload.maximum_size=4096
ateval-tiny2313.menu.cpu.t4313.upload.protocol=avrispmkii
ateval-tiny2313.menu.cpu.t4313.upload.tool=avrdude
ateval-tiny2313.menu.cpu.t4313.upload.high_fuses=0xDF
ateval-tiny2313.menu.cpu.t4313.upload.extended_fuses=0xFF
ateval-tiny2313.menu.cpu.t4313.build.mcu=attiny4313
ateval-tiny2313.menu.cpu.t4313.build.variant=t2313

##############################################################
# ateval with Attiny25 attached (no BL here, just for real men.)
ateval-tiny85.menu.cpu.attiny25=Attiny25
ateval-tiny85.menu.cpu.attiny25.upload.maximum_size=2048
ateval-tiny85.menu.cpu.attiny25.upload.maximum_data_size=128
ateval-tiny85.menu.cpu.attiny25.upload.protocol=avrispmkii
ateval-tiny85.menu.cpu.attiny25.upload.tool=avrdude
ateval-tiny85.menu.cpu.attiny25.upload.high_fuses=0xDF
ateval-tiny85.menu.cpu.attiny25.upload.extended_fuses=0xFF
ateval-tiny85.menu.cpu.attiny25.build.mcu=attiny25
ateval-tiny85.menu.cpu.attiny25.build.variant=tiny8

##############################################################
# ateval with Attiny45 attached (no BL here, just for real men.)
ateval-tiny85.menu.cpu.attiny45=ATtiny45
ateval-tiny85.menu.cpu.attiny45.upload.maximum_size=4096
ateval-tiny85.menu.cpu.attiny45.upload.maximum_data_size=256
ateval-tiny85.menu.cpu.attiny45.upload.protocol=avrispmkii
ateval-tiny85.menu.cpu.attiny45.upload.tool=avrdude
ateval-tiny85.menu.cpu.attiny45.upload.high_fuses=0xDF
ateval-tiny85.menu.cpu.attiny45.upload.extended_fuses=0xFF
ateval-tiny85.menu.cpu.attiny45.build.mcu=attiny45
ateval-tiny85.menu.cpu.attiny45.build.variant=tiny8

##############################################################
# ateval with Attiny85 attached (no BL here, just for real men.)
ateval-tiny85.menu.cpu.attiny85=ATtiny85
ateval-tiny85.menu.cpu.attiny85.upload.maximum_size=8192
ateval-tiny85.menu.cpu.attiny85.upload.maximum_data_size=512
ateval-tiny85.menu.cpu.attiny85.upload.protocol=avrispmkii
ateval-tiny85.menu.cpu.attiny85.upload.tool=avrdude
ateval-tiny85.menu.cpu.attiny85.upload.high_fuses=0xDF
ateval-tiny85.menu.cpu.attiny85.upload.extended_fuses=0xFF
ateval-tiny85.menu.cpu.attiny85.build.mcu=attiny85
ateval-tiny85.menu.cpu.attiny85.build.variant=tiny8

## MCUDude stuff begins here:
##############################################################
# ateval with ATmega16 attached
ateval-m16.name=aTeVaL IC4 (Atmega16, ...)
ateval-m16.upload.tool=avrdude
ateval-m16.upload.maximum_data_size=1024
ateval-m16.bootloader.tool=avrdude
ateval-m16.bootloader.unlock_bits=0x3f
ateval-m16.bootloader.lock_bits=0x0f
ateval-m16.bootloader.low_fuses=0b{bootloader.bod_bits}{bootloader.sut_cksel_bits}
ateval-m16.bootloader.high_fuses=0b110{bootloader.ckopt_bit}010{bootloader.bootrst_bit}
ateval-m16.build.core=arduino:arduino
ateval-m16.build.board=uno
ateval-m16.build.mcu=atmega16


# Upload port select
ateval-m16.menu.bootloader.uart0=Yes (UART0)
ateval-m16.menu.bootloader.uart0.upload.maximum_size=15872
ateval-m16.menu.bootloader.uart0.upload.protocol=arduino
ateval-m16.menu.bootloader.uart0.upload.port=UART0
ateval-m16.menu.bootloader.uart0.bootloader.bootrst_bit=0
ateval-m16.menu.bootloader.uart0.bootloader.file=optiboot_flash/bootloaders/{build.mcu}/{build.f_cpu}/optiboot_flash_{build.mcu}_{upload.port}_{upload.speed}_{build.f_cpu}_B5.hex
ateval-m16.menu.bootloader.no_bootloader=No bootloader
ateval-m16.menu.bootloader.no_bootloader.upload.maximum_size=16384
ateval-m16.menu.bootloader.no_bootloader.bootloader.bootrst_bit=1
ateval-m16.menu.bootloader.no_bootloader.bootloader.file=empty/empty.hex


