josefwegner/arduino-boards/src/ehajo-avr-2.0.0/boards.txt
# Brown out detection - This is the first part of the low fuse bit concatenation
ateval-m16.menu.BOD.2v7=BOD 2.7V
ateval-m16.menu.BOD.2v7.bootloader.bod_bits=10
ateval-m16.menu.BOD.4v0=BOD 4.0V
ateval-m16.menu.BOD.4v0.bootloader.bod_bits=00
ateval-m16.menu.BOD.disabled=BOD disabled
ateval-m16.menu.BOD.disabled.bootloader.bod_bits=11

# Compiler link time optimization
ateval-m16.menu.LTO.Os=LTO deaktiviert
ateval-m16.menu.LTO.Os.compiler.c.extra_flags=
ateval-m16.menu.LTO.Os.compiler.c.elf.extra_flags=
ateval-m16.menu.LTO.Os.compiler.cpp.extra_flags=
ateval-m16.menu.LTO.Os.ltoarcmd=avr-ar

ateval-m16.menu.LTO.Os_flto=LTO aktiviert
ateval-m16.menu.LTO.Os_flto.compiler.c.extra_flags=-Wextra -flto -g
ateval-m16.menu.LTO.Os_flto.compiler.c.elf.extra_flags=-w -flto -g
ateval-m16.menu.LTO.Os_flto.compiler.cpp.extra_flags=-Wextra -flto -g
ateval-m16.menu.LTO.Os_flto.ltoarcmd=avr-gcc-ar

# Clock frequencies - This is the second part of the low fuse bit concatenation
ateval-m16.menu.clock.16MHz_external=External 16 MHz
ateval-m16.menu.clock.16MHz_external.upload.speed=115200
ateval-m16.menu.clock.16MHz_external.bootloader.sut_cksel_bits=111111
ateval-m16.menu.clock.16MHz_external.bootloader.ckopt_bit=0
ateval-m16.menu.clock.16MHz_external.build.f_cpu=16000000L

ateval-m16.menu.clock.20MHz_external=External 20 MHz
ateval-m16.menu.clock.20MHz_external.upload.speed=115200
ateval-m16.menu.clock.20MHz_external.bootloader.sut_cksel_bits=111111
ateval-m16.menu.clock.20MHz_external.bootloader.ckopt_bit=0
ateval-m16.menu.clock.20MHz_external.build.f_cpu=20000000L

ateval-m16.menu.clock.18_432MHz_external=External 18.4320 MHz
ateval-m16.menu.clock.18_432MHz_external.upload.speed=115200
ateval-m16.menu.clock.18_432MHz_external.bootloader.sut_cksel_bits=111111
ateval-m16.menu.clock.18_432MHz_external.bootloader.ckopt_bit=0
ateval-m16.menu.clock.18_432MHz_external.build.f_cpu=18432000L

ateval-m16.menu.clock.14_7456MHz_external=External 14.7456 MHz
ateval-m16.menu.clock.14_7456MHz_external.upload.speed=115200
ateval-m16.menu.clock.14_7456MHz_external.bootloader.sut_cksel_bits=111111
ateval-m16.menu.clock.14_7456MHz_external.bootloader.ckopt_bit=0
ateval-m16.menu.clock.14_7456MHz_external.build.f_cpu=14745600L

ateval-m16.menu.clock.12MHz_external=External 12 MHz
ateval-m16.menu.clock.12MHz_external.upload.speed=57600
ateval-m16.menu.clock.12MHz_external.bootloader.sut_cksel_bits=111111
ateval-m16.menu.clock.12MHz_external.bootloader.ckopt_bit=0
ateval-m16.menu.clock.12MHz_external.build.f_cpu=12000000L

ateval-m16.menu.clock.11_0592MHz_external=External 11.0592 MHz
ateval-m16.menu.clock.11_0592MHz_external.upload.speed=115200
ateval-m16.menu.clock.11_0592MHz_external.bootloader.sut_cksel_bits=111111
ateval-m16.menu.clock.11_0592MHz_external.bootloader.ckopt_bit=0
ateval-m16.menu.clock.11_0592MHz_external.build.f_cpu=11059200L

ateval-m16.menu.clock.8MHz_external=External 8 MHz
ateval-m16.menu.clock.8MHz_external.upload.speed=57600
ateval-m16.menu.clock.8MHz_external.bootloader.sut_cksel_bits=111111
ateval-m16.menu.clock.8MHz_external.bootloader.ckopt_bit=0
ateval-m16.menu.clock.8MHz_external.build.f_cpu=8000000L

ateval-m16.menu.clock.7_3728MHz_external=External 7.3728 MHz
ateval-m16.menu.clock.7_3728MHz_external.upload.speed=115200
ateval-m16.menu.clock.7_3728MHz_external.bootloader.sut_cksel_bits=111111
ateval-m16.menu.clock.7_3728MHz_external.bootloader.ckopt_bit=0
ateval-m16.menu.clock.7_3728MHz_external.build.f_cpu=7372800L

ateval-m16.menu.clock.3_6864MHz_external=External 3.6864 MHz
ateval-m16.menu.clock.3_6864MHz_external.upload.speed=115200
ateval-m16.menu.clock.3_6864MHz_external.bootloader.sut_cksel_bits=111111
ateval-m16.menu.clock.3_6864MHz_external.bootloader.ckopt_bit=0
ateval-m16.menu.clock.3_6864MHz_external.build.f_cpu=3686400L

ateval-m16.menu.clock.1_8432MHz_external=External 1.8432 MHz
ateval-m16.menu.clock.1_8432MHz_external.upload.speed=115200
ateval-m16.menu.clock.1_8432MHz_external.bootloader.sut_cksel_bits=111111
ateval-m16.menu.clock.1_8432MHz_external.bootloader.ckopt_bit=0
ateval-m16.menu.clock.1_8432MHz_external.build.f_cpu=1843200L

ateval-m16.menu.clock.8MHz_internal=Internal 8 MHz
ateval-m16.menu.clock.8MHz_internal.upload.speed=38400
ateval-m16.menu.clock.8MHz_internal.bootloader.sut_cksel_bits=100100
ateval-m16.menu.clock.8MHz_internal.bootloader.ckopt_bit=1
ateval-m16.menu.clock.8MHz_internal.build.f_cpu=8000000L

ateval-m16.menu.clock.1MHz_internal=Internal 1 MHz
ateval-m16.menu.clock.1MHz_internal.upload.speed=9600
ateval-m16.menu.clock.1MHz_internal.bootloader.sut_cksel_bits=100001
ateval-m16.menu.clock.1MHz_internal.bootloader.ckopt_bit=1
ateval-m16.menu.clock.1MHz_internal.build.f_cpu=1000000L




##############################################################
##############################################################
##############################################################
##############################################################
# Gscheiduino Board begins here:


# Gscheiduino general settings here:
gscheiduino-mega.name=Gscheiduino (Atmega8, ...)
gscheiduino-mega.bootloader.unlock_bits=0xFF
gscheiduino-mega.bootloader.lock_bits=0xCF
gscheiduino-mega.bootloader.tool=avrdude
gscheiduino-mega.build.core=arduino:arduino
gscheiduino-mega.build.board=uno
gscheiduino-mega.upload.tool=avrdude

gscheiduino-tiny13.name=Gscheiduino (Attiny13, ...)
gscheiduino-tiny13.bootloader.unlock_bits=0xFF
gscheiduino-tiny13.bootloader.lock_bits=0xCF
gscheiduino-tiny13.bootloader.tool=avrdude
gscheiduino-tiny13.build.core=arduino:arduino
gscheiduino-tiny13.build.board=uno
gscheiduino-tiny13.upload.tool=avrdude

gscheiduino-tiny2313.name=Gscheiduino (Attiny2313, ...)
gscheiduino-tiny2313.bootloader.unlock_bits=0xFF
gscheiduino-tiny2313.bootloader.lock_bits=0xCF
gscheiduino-tiny2313.bootloader.tool=avrdude
gscheiduino-tiny2313.build.core=arduino:arduino
gscheiduino-tiny2313.build.board=uno
gscheiduino-tiny2313.upload.tool=avrdude

gscheiduino-tiny85.name=Gscheiduino (Attiny85, ...)
gscheiduino-tiny85.bootloader.unlock_bits=0xFF
gscheiduino-tiny85.bootloader.lock_bits=0xCF
gscheiduino-tiny85.bootloader.tool=avrdude
gscheiduino-tiny85.build.core=arduino:arduino
gscheiduino-tiny85.build.board=uno
gscheiduino-tiny85.upload.tool=avrdude

