josefwegner/arduino-boards/src/ehajo-avr-2.0.0/boards.txt
##############################################################
# Gscheiduino with Atmega168P without Bootloader
gscheiduino-mega.menu.cpu.m168=Atmega168P w/o Bootloader
gscheiduino-mega.menu.cpu.m168.upload.maximum_size=16384
gscheiduino-mega.menu.cpu.m168.upload.protocol=avrispmkii
gscheiduino-mega.menu.cpu.m168.upload.tool=avrdude
gscheiduino-mega.menu.cpu.m168.upload.extended_fuses=0xFD
gscheiduino-mega.menu.cpu.m168.upload.high_fuses=0xDE
gscheiduino-mega.menu.cpu.m168.build.mcu=atmega168p
gscheiduino-mega.menu.cpu.m168.build.variant=gscheiduino-std

##############################################################
# Gscheiduino with Attiny13 attached (no BL here, just for real men.)
gscheiduino-tiny13.menu.cpu.t13=Atiny13 w/o Bootloader
gscheiduino-tiny13.menu.cpu.t13.upload.maximum_size=1024
gscheiduino-tiny13.menu.cpu.t13.upload.protocol=avrispmkii
gscheiduino-tiny13.menu.cpu.t13.upload.tool=avrdude
gscheiduino-tiny13.menu.cpu.t13.upload.high_fuses=0xFF
gscheiduino-tiny13.menu.cpu.t13.upload.extended_fuses=0xFF
gscheiduino-tiny13.menu.cpu.t13.build.mcu=attiny13
gscheiduino-tiny13.menu.cpu.t13.build.variant=gscheiduino-t13

##############################################################
# Gscheiduino with Attiny2313 attached (no BL here, just for real men.)
gscheiduino-tiny2313.menu.cpu.t2313=Atiny2313 w/o Bootloader
gscheiduino-tiny2313.menu.cpu.t2313.upload.maximum_size=2048
gscheiduino-tiny2313.menu.cpu.t2313.upload.protocol=avrispmkii
gscheiduino-tiny2313.menu.cpu.t2313.upload.tool=avrdude
gscheiduino-tiny2313.menu.cpu.t2313.upload.high_fuses=0xDF
gscheiduino-tiny2313.menu.cpu.t2313.upload.extended_fuses=0xFF
gscheiduino-tiny2313.menu.cpu.t2313.build.mcu=attiny2313
gscheiduino-tiny2313.menu.cpu.t2313.build.variant=gscheiduino-t2313

##############################################################
# Gscheiduino with Attiny4313 attached (no BL here, just for real men.)
gscheiduino-tiny2313.menu.cpu.t4313=Atiny4313 w/o Bootloader
gscheiduino-tiny2313.menu.cpu.t4313.upload.maximum_size=4096
gscheiduino-tiny2313.menu.cpu.t4313.upload.protocol=avrispmkii
gscheiduino-tiny2313.menu.cpu.t4313.upload.tool=avrdude
gscheiduino-tiny2313.menu.cpu.t4313.upload.high_fuses=0xDF
gscheiduino-tiny2313.menu.cpu.t4313.upload.extended_fuses=0xFF
gscheiduino-tiny2313.menu.cpu.t4313.build.mcu=attiny4313
gscheiduino-tiny2313.menu.cpu.t4313.build.variant=gscheiduino-t2313

##############################################################
# Gscheiduino with Attiny45 attached (no BL here, just for real men.)
gscheiduino-tiny85.menu.cpu.attiny45=ATtiny45
gscheiduino-tiny85.menu.cpu.attiny45.upload.maximum_size=4096
gscheiduino-tiny85.menu.cpu.attiny45.upload.maximum_data_size=256
gscheiduino-tiny85.menu.cpu.attiny45.upload.protocol=avrispmkii
gscheiduino-tiny85.menu.cpu.attiny45.upload.tool=avrdude
gscheiduino-tiny85.menu.cpu.attiny45.upload.high_fuses=0xDF
gscheiduino-tiny85.menu.cpu.attiny45.upload.extended_fuses=0xFF
gscheiduino-tiny85.menu.cpu.attiny45.build.mcu=attiny45
gscheiduino-tiny85.menu.cpu.attiny45.build.variant=tiny8

##############################################################
# Gscheiduino with Attiny85 attached (no BL here, just for real men.)
gscheiduino-tiny85.menu.cpu.attiny85=ATtiny85
gscheiduino-tiny85.menu.cpu.attiny85.upload.maximum_size=8192
gscheiduino-tiny85.menu.cpu.attiny85.upload.maximum_data_size=512
gscheiduino-tiny85.menu.cpu.attiny85.upload.protocol=avrispmkii
gscheiduino-tiny85.menu.cpu.attiny85.upload.tool=avrdude
gscheiduino-tiny85.menu.cpu.attiny85.upload.high_fuses=0xDF
gscheiduino-tiny85.menu.cpu.attiny85.upload.extended_fuses=0xFF
gscheiduino-tiny85.menu.cpu.attiny85.build.mcu=attiny85
gscheiduino-tiny85.menu.cpu.attiny85.build.variant=tiny8





##############################################################
##############################################################
##############################################################
##############################################################
# Fishfeeder Board begins here:
fishfeeder.name=Fishfeeder

fishfeeder.vid.0=0x2341
fishfeeder.pid.0=0x0037
fishfeeder.vid.1=0x2341
fishfeeder.pid.1=0x8037
fishfeeder.vid.2=0x2A03
fishfeeder.pid.2=0x0037
fishfeeder.vid.3=0x2A03
fishfeeder.pid.3=0x8037
fishfeeder.vid.4=0x2341
fishfeeder.pid.4=0x0237
# If the board is a 2341:0237 use 2341:8237 for build and set
# other parameters as well
fishfeeder.vid.4.build.vid=0x2341
fishfeeder.vid.4.build.pid=0x8237
fishfeeder.vid.4.build.usb_product="Genuino Micro"
fishfeeder.vid.4.bootloader.file=caterina/Caterina-Genuino-micro.hex
fishfeeder.vid.5=0x2341
fishfeeder.pid.5=0x8237
# If the board is a 2341:8237 use 2341:8237 for build and set
# other paramters as well
fishfeeder.vid.5.build.vid=0x2341
fishfeeder.vid.5.build.pid=0x8237
fishfeeder.vid.5.build.usb_product="Genuino Micro"
fishfeeder.vid.5.bootloader.file=caterina/Caterina-Genuino-micro.hex

fishfeeder.upload.tool=avrdude
fishfeeder.upload.protocol=avr109
fishfeeder.upload.maximum_size=28672
fishfeeder.upload.maximum_data_size=2560
fishfeeder.upload.speed=57600
fishfeeder.upload.disable_flushing=true
fishfeeder.upload.use_1200bps_touch=true
fishfeeder.upload.wait_for_upload_port=true

fishfeeder.bootloader.tool=avrdude
fishfeeder.bootloader.low_fuses=0xff
fishfeeder.bootloader.high_fuses=0xd8
fishfeeder.bootloader.extended_fuses=0xcb
fishfeeder.bootloader.file=caterina/Caterina-micro.hex
fishfeeder.bootloader.unlock_bits=0x3F
fishfeeder.bootloader.lock_bits=0x2F

fishfeeder.build.mcu=atmega32u4
fishfeeder.build.f_cpu=16000000L
fishfeeder.build.vid=0x2341
fishfeeder.build.pid=0x8037
fishfeeder.build.usb_product="eHaJo Fishfeeder"
fishfeeder.build.board=AVR_MICRO
fishfeeder.build.core=arduino
fishfeeder.build.variant=fishfeeder
fishfeeder.build.extra_flags={build.usb_flags}
